app/Http/Controllers/Auth/RegisteredUserController.php

insert into [users] ([name], [email], [password], [role_id], [updated_at], [created_at]) values ('Nguyễn Đức Hậu', 'hau.nguyenbk19@hcmut.edu.vn', '$2y$10$rtw7mvyTEjw3Y1Qq3GxOl.OU3u1pZZ/oAr7BFHtseDHuJt6gL0HPK', 4, '2023-05-19 16:36:18.075', '2023-05-19 16:36:18.075')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|string|email|max:255|ends_with:hcmut.edu.vn|unique:'.User::class,
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = User::create([
            'name' => $request->name,
            'email' => $request->email,
            'password' => Hash::make($request->password),
            'role_id' => 4,
        ]);