app/Http/Controllers/Admin/ImportController.php

    public function storeTeacher(ImportFileCsvRequest $request) {
        $file_name = date('Ymd_His_').$request->csv_import->getClientOriginalName();
        $file_path = storage_path('app\\data\\'.$file_name);

        DB::insert('INSERT INTO dbo.imports (name, path, status, created_by)
                    VALUES (?,?,?,?)',
                    [$file_name, $file_path, 0, Auth::user()->name]);
        $import = DB::select('SELECT top(1) * FROM dbo.imports ORDER BY dbo.imports.id DESC')[0];
        $request->csv_import->move(storage_path('app\\data\\'), $file_name);

        $teacherImport = Import::latest()->first();
---
select top 1 * from [Imports] order by [created_at] desc